crypto-server/app/controllers/api/transactions_controller.rb

INSERT INTO "transactions" ("date_time", "email", "recipient_address", "transaction_id", "from_currency", "to_currency", "exchange_rate", "exchange_fee", "status", "created_at", "updated_at") VALUES ('2025-04-08 15:01:19.025369', 'maratozavar@gmail.com', '1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa', NULL, 23.0, 0.0002771158, 0.0000126901, 0.0000087562, 'Success', '2025-04-08 15:01:19.025186', '2025-04-08 15:01:19.025186') RETURNING "id"
---
  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.status = 'Success'
    if @transaction.save