crypto-server/app/controllers/admin/auth_controller.rb

SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."username" = 'admin' LIMIT 1
---
  def authenticate_admin
    authenticate_or_request_with_http_basic do |username, password|
      user = AdminUser.find_by(username: username)