crypto-server/app/controllers/admin/dashboards_controller.rb

SELECT SUM("transactions"."exchange_fee") FROM "transactions"
SELECT COUNT(*) FROM "transactions"
SELECT "transactions".* FROM "transactions"
---
  def total_info
    total_exchange_fee = Transaction.sum(:exchange_fee)
    transactions_count = Transaction.count
    total_success_transactions = Transaction.success.size

SELECT "transactions".* FROM "transactions"
---
    scope = Transaction.all

SELECT COUNT(*) FROM "transactions"
---
      scope = scope.
        page(params[:page]).
        per([params[:size], 10].map(&:presence).compact.map(&:to_i).min)
    end

    render json: {
      transactions: scope,
      total_size: Transaction.count